{
  "recipes": [
    {
      "id": 1,
      "dishName": "Meatballs with Mashed Potatoes",
      "author": "Anna Virtanen",
      "country": "Finland",
      "description": "A traditional Finnish dish consisting of juicy meatballs served with creamy mashed potatoes.",
      "prep_time": "20 minutes",
      "cook_time": "1 hour",
      "servings": 4,
      "ingredients": [
        {
          "name": "Potatoes",
          "quantity": "1 kg"
        },
        {
          "name": "Ground beef",
          "quantity": "500 grams"
        },
        {
          "name": "Bread crumbs",
          "quantity": "100 grams"
        },
        {
          "name": "Egg",
          "quantity": "1"
        },
        {
          "name": "Garlic",
          "quantity": "3 cloves"
        },
        {
          "name": "Onion",
          "quantity": "1"
        },
        {
          "name": "Milk",
          "quantity": "100 ml"
        },
        {
          "name": "Butter",
          "quantity": "50 grams"
        },
        {
          "name": "Lingonberry jam",
          "quantity": "for serving"
        },
        {
          "name": "Salt",
          "quantity": "to taste"
        },
        {
          "name": "Pepper",
          "quantity": "to taste"
        },
        {
          "name": "Olive oil",
          "quantity": "2 tablespoons"
        }
      ],
      "steps": [
        "Peel and dice the potatoes. Place them in a large pot of salted water and bring to a boil. Cook until the potatoes are tender, then drain.",
        "In a mixing bowl, combine the ground beef, bread crumbs, egg, minced garlic, finely chopped onion, salt, and pepper. Mix well until all the ingredients are evenly incorporated.",
        "Shape the meat mixture into meatballs of your desired size.",
        "Heat the olive oil in a large skillet over medium-high heat. Add the meatballs and cook until they are browned on all sides, approximately 5 minutes.",
        "Remove the meatballs from the skillet and set them aside.",
        "In the same skillet, melt the butter over medium heat. Add the cooked potatoes and mash them using a potato masher or fork.",
        "Gradually add milk while mashing the potatoes, until you reach a creamy consistency. Season with salt and pepper to taste.",
        "Return the meatballs to the skillet with the mashed potatoes and heat them together for a few minutes to combine the flavors.",
        "Serve the meatballs and mashed potatoes hot, with lingonberry jam on the side."
      ]
    },
    {
      "id": 2,
      "dishName": "Moussaka",
      "author": "Maria Papadopoulos",
      "country": "Greece",
      "description": "A classic Greek dish with layers of eggplant, meat, and béchamel sauce, baked to perfection.",
      "prep_time": "30 minutes",
      "cook_time": "1 hour 30 minutes",
      "servings": 6,
      "ingredients": [
        {
          "name": "Eggplant",
          "quantity": "2"
        },
        {
          "name": "Ground beef",
          "quantity": "500 grams"
        },
        {
          "name": "Onion",
          "quantity": "1"
        },
        {
          "name": "Garlic",
          "quantity": "3 cloves"
        },
        {
          "name": "Canned diced tomatoes",
          "quantity": "400 grams"
        },
        {
          "name": "Red wine",
          "quantity": "100 ml"
        },
        {
          "name": "Olive oil",
          "quantity": "4 tablespoons"
        },
        {
          "name": "Potatoes",
          "quantity": "3"
        },
        {
          "name": "Milk",
          "quantity": "500 ml"
        },
        {
          "name": "Butter",
          "quantity": "50 grams"
        },
        {
          "name": "All-purpose flour",
          "quantity": "50 grams"
        },
        {
          "name": "Grated Parmesan cheese",
          "quantity": "50 grams"
        },
        {
          "name": "Eggs",
          "quantity": "2"
        },
        {
          "name": "Ground cinnamon",
          "quantity": "1/2 teaspoon"
        },
        {
          "name": "Nutmeg",
          "quantity": "1/4 teaspoon"
        },
        {
          "name": "Salt",
          "quantity": "to taste"
        },
        {
          "name": "Black pepper",
          "quantity": "to taste"
        }
      ],
      "steps": [
        "Preheat the oven to 180 degrees Celsius (350 degrees Fahrenheit).",
        "Slice the eggplants into 1/4-inch thick rounds. Lightly salt them and let them sit for 15 minutes to remove excess moisture. Rinse and pat dry.",
        "In a large skillet, heat 2 tablespoons of olive oil over medium heat. Add the sliced eggplants and cook until golden brown on both sides. Remove from the skillet and set aside.",
        "In the same skillet, add 2 tablespoons of olive oil and sauté the chopped onion and minced garlic until softened.",
        "Add the ground beef and cook until browned. Stir in the diced tomatoes, red wine, ground cinnamon, nutmeg, salt, and pepper. Simmer for 10 minutes, then remove from heat.",
        "In a separate saucepan, melt the butter over medium heat. Stir in the flour and cook for 1-2 minutes. Gradually whisk in the milk until smooth. Cook until the sauce thickens, then remove from heat. Stir in the grated Parmesan cheese and beaten eggs.",
        "Slice the potatoes into 1/4-inch thick rounds.",
        "In a greased baking dish, arrange a layer of potatoes at the bottom. Top with a layer of cooked eggplant slices. Spread half of the meat sauce over the eggplant.",
        "Add another layer of eggplant slices and top with the remaining meat sauce. Finally, pour the béchamel sauce evenly over the top layer.",
        "Bake the Moussaka in the preheated oven for 45 minutes to 1 hour, or until the top is golden brown and bubbly.",
        "Remove from the oven and let it cool for a few minutes before serving.",
        "Moussaka is traditionally served warm as a main dish. It pairs well with a fresh Greek salad and crusty bread.",
        "Enjoy the rich and flavorful taste of this classic Greek Moussaka!"
      ]
    },
    {
      "id": 3,
      "dishName": "Borscht",
      "author": "Olga Ivanova",
      "country": "Russia",
      "description": "A traditional Russian beet soup with rich flavors and vibrant colors.",
      "prep_time": "30 minutes",
      "cook_time": "1 hour 30 minutes",
      "servings": 6,
      "ingredients": [
        {
          "name": "Beets",
          "quantity": "3"
        },
        {
          "name": "Cabbage",
          "quantity": "1/2 head"
        },
        {
          "name": "Potatoes",
          "quantity": "2"
        },
        {
          "name": "Carrots",
          "quantity": "2"
        },
        {
          "name": "Onion",
          "quantity": "1"
        },
        {
          "name": "Garlic",
          "quantity": "3 cloves"
        },
        {
          "name": "Tomato paste",
          "quantity": "2 tablespoons"
        },
        {
          "name": "Beef or vegetable broth",
          "quantity": "4 cups"
        },
        {
          "name": "Bay leaves",
          "quantity": "2"
        },
        {
          "name": "Fresh dill",
          "quantity": "2 tablespoons"
        },
        {
          "name": "Sour cream",
          "quantity": "for serving"
        },
        {
          "name": "Salt",
          "quantity": "to taste"
        },
        {
          "name": "Black pepper",
          "quantity": "to taste"
        },
        {
          "name": "Vegetable oil",
          "quantity": "2 tablespoons"
        },
        {
          "name": "White vinegar",
          "quantity": "1 tablespoon"
        }
      ],
      "steps": [
        "Peel and grate the beets, cabbage, potatoes, and carrots. Finely chop the onion and mince the garlic.",
        "In a large pot, heat the vegetable oil over medium heat. Add the onion and garlic, and sauté until fragrant and translucent.",
        "Add the grated beets, cabbage, carrots, and potatoes to the pot. Stir in the tomato paste and cook for 5 minutes, allowing the flavors to meld together.",
        "Pour in the beef or vegetable broth. Add the bay leaves, salt, and black pepper. Bring the soup to a boil, then reduce the heat to low and let it simmer for 1 hour, or until the vegetables are tender.",
        "Stir in the white vinegar and fresh dill. Taste the soup and adjust the seasoning if needed.",
        "Serve the borscht hot, topped with a dollop of sour cream and garnished with additional fresh dill."
      ]
    },
    {
      "id": 4,
      "dishName": "Sauerkraut Soup",
      "author": "Kristina Kask",
      "country": "Estonia",
      "description": "A comforting and flavorful soup made with sauerkraut, pork, and root vegetables.",
      "prep_time": "15 minutes",
      "cook_time": "1 hour 30 minutes",
      "servings": 6,
      "ingredients": [
        {
          "name": "Sauerkraut",
          "quantity": "500 grams"
        },
        {
          "name": "Pork shoulder",
          "quantity": "400 grams, cubed"
        },
        {
          "name": "Onion",
          "quantity": "1, chopped"
        },
        {
          "name": "Carrots",
          "quantity": "2, sliced"
        },
        {
          "name": "Potatoes",
          "quantity": "3, peeled and diced"
        },
        {
          "name": "Bay leaves",
          "quantity": "2"
        },
        {
          "name": "Allspice berries",
          "quantity": "4"
        },
        {
          "name": "Juniper berries",
          "quantity": "4"
        },
        {
          "name": "Smoked bacon",
          "quantity": "100 grams, chopped"
        },
        {
          "name": "Beef or vegetable broth",
          "quantity": "6 cups"
        },
        {
          "name": "Fresh dill",
          "quantity": "2 tablespoons, chopped"
        },
        {
          "name": "Sour cream",
          "quantity": "for serving"
        },
        {
          "name": "Salt",
          "quantity": "to taste"
        },
        {
          "name": "Black pepper",
          "quantity": "to taste"
        },
        {
          "name": "Vegetable oil",
          "quantity": "2 tablespoons"
        }
      ],
      "steps": [
        "In a large pot, heat the vegetable oil over medium heat. Add the chopped onion and sauté until translucent.",
        "Add the chopped bacon and cubed pork shoulder to the pot. Cook until the pork is browned on all sides.",
        "Add the sliced carrots and diced potatoes to the pot. Stir in the sauerkraut, bay leaves, allspice berries, and juniper berries.",
        "Pour in the beef or vegetable broth. Bring the soup to a boil, then reduce the heat to low and let it simmer for 1 hour, or until the pork is tender and the flavors have melded together.",
        "Remove the bay leaves, allspice berries, and juniper berries from the soup. Season with salt and black pepper to taste.",
        "Serve the sauerkraut soup hot, garnished with fresh chopped dill and a dollop of sour cream.",
        "Enjoy the comforting flavors of this traditional Estonian sauerkraut soup!"
      ]
    },
    {
      "id": 5,
      "dishName": "Spaghetti Carbonara",
      "author": "Marco Rossi",
      "country": "Italy",
      "description": "A classic Italian pasta dish made with bacon, eggs, and cheese.",
      "prep_time": "10 minutes",
      "cook_time": "20 minutes",
      "servings": 4,
      "ingredients": [
        {
          "name": "spaghetti",
          "quantity": "12 ounces"
        },
        {
          "name": "bacon",
          "quantity": "6 slices"
        },
        {
          "name": "garlic",
          "quantity": "2 cloves"
        },
        {
          "name": "eggs",
          "quantity": "2"
        },
        {
          "name": "Parmesan cheese",
          "quantity": "1/2 cup"
        },
        {
          "name": "black pepper",
          "quantity": "1/2 teaspoon"
        }
      ],
      "steps": [
        "Cook spaghetti according to package instructions. Drain and set aside.",
        "Cook bacon in a large skillet over medium heat until crispy. Remove bacon and crumble it into small pieces. Reserve bacon fat in the skillet.",
        "Add garlic to the skillet with the bacon fat and cook for 30 seconds.",
        "In a bowl, beat the eggs and Parmesan cheese together. Add black pepper and stir to combine.",
        "Add the cooked spaghetti and crumbled bacon to the skillet with the garlic. Toss to combine.",
        "Remove the skillet from heat and add the egg and cheese mixture. Toss to combine, making sure the spaghetti is coated with the mixture.",
        "Serve hot with extra Parmesan cheese and black pepper, if desired."
      ]
    },
    {
      "id": 6,
      "dishName": "Varenyky (Ukrainian Dumplings)",
      "author": "Natalia Petrenko",
      "country": "Ukraine",
      "description": "Traditional Ukrainian dumplings filled with a variety of savory fillings.",
      "prep_time": "45 minutes",
      "cook_time": "20 minutes",
      "servings": 4,
      "ingredients": [
        {
          "name": "All-purpose flour",
          "quantity": "2 cups"
        },
        {
          "name": "Water",
          "quantity": "1/2 cup"
        },
        {
          "name": "Salt",
          "quantity": "1/2 teaspoon"
        },
        {
          "name": "Potatoes",
          "quantity": "3 medium, boiled and mashed"
        },
        {
          "name": "Onion",
          "quantity": "1 medium, finely chopped"
        },
        {
          "name": "Butter",
          "quantity": "2 tablespoons"
        },
        {
          "name": "Sour cream",
          "quantity": "for serving"
        },
        {
          "name": "Salt",
          "quantity": "to taste"
        },
        {
          "name": "Black pepper",
          "quantity": "to taste"
        }
      ],
      "steps": [
        "In a large mixing bowl, combine the flour, water, and salt. Knead the dough until it becomes smooth and elastic.",
        "Cover the dough with a damp cloth and let it rest for 30 minutes.",
        "Meanwhile, in a skillet, sauté the chopped onion in butter until golden brown.",
        "In a separate bowl, mix the mashed potatoes with the sautéed onions. Season with salt and black pepper to taste.",
        "On a lightly floured surface, roll out the dough to a thickness of about 1/8 inch.",
        "Cut out circles from the rolled dough using a round cookie cutter or a glass.",
        "Place a spoonful of the potato filling in the center of each dough circle.",
        "Fold the dough over the filling to create a half-moon shape. Press the edges together to seal the dumplings.",
        "Bring a large pot of salted water to a boil. Drop the dumplings into the boiling water and cook for about 5-7 minutes, or until they float to the surface.",
        "Using a slotted spoon, remove the cooked dumplings from the water and place them on a serving dish.",
        "Serve the varenyky hot, accompanied by sour cream.",
        "Enjoy the delicious taste of these traditional Ukrainian dumplings!"
      ]
    }
  ]
}